<?php
/**
 * 
 * +------------------------------------------------------------+
 * @category field
 * +------------------------------------------------------------+
 * 资源管理配置
 * +------------------------------------------------------------+
 *
 * @author nish
 * @copyright http://www.onlyni.com 2019
 * Created on 2019年3月27日 11:28:33
 */

//配置文件
return [
    'Admin' => [
    	'title'	 => '用户管理',
    	'list'	 => [
       //      'Admin' => [
    			// 'title'	=> '用户管理',
    			// 'list'	=> [
    			//      ['title'=>'用户名修改','field'=>'username_edit'],
    			// ]
       //      ],

       //      'Huawei' => [
       //          'title' => '华为云管理',
       //          'list'  => [
       //               ['title'=>'返佣比例修改','field'=>'user_recommend_commission'],
       //          ]
       //      ],
    	]
    ],
];