<?php
// +----------------------------------------------------------------------
// +----------------------------------------------------------------------
// | Author: nish
// +----------------------------------------------------------------------

// +----------------------------------------------------------------------
// | 缓存设置
// +----------------------------------------------------------------------

return [
    //缓存配置为复合类型
    'type'  =>  'complex', 
    
    'default'	=>	[
        'type'	=>	'file',
        //全局缓存有效期（0为永久有效）

        'expire'  =>  0,
        //缓存前缀
        'prefix'  =>  'file',
        //缓存目录
        'path'    =>  '../runtime/cache/',
    ],

    'redis'	=>	[
        'type'	        => 'redis',
        'host'	        => '127.0.0.1',
        'port'          => 6379,
        'password'      => '',

        // 全局缓存有效期（0为永久有效）
        'expire'        =>  0,
        // 缓存前缀
        'prefix'        =>  '',
    ],
    
    'memcache'	=>	[
        'type'	        => 'memcache',
        'host'	        => '127.0.0.1',
        'port'          => 11211,
        'username'      => '',
        'password'      => '',

        // 全局缓存有效期（0为永久有效）
        'expire'        =>  0,
        // 缓存前缀
        'prefix'        =>  '',
    ],

    'memcached'	=>	[
        'type'	        => 'memcached',
        'host'	        => '127.0.0.1',
        'port'          => 11211,
        'username'      => '',
        'password'      => '',

        // 全局缓存有效期（0为永久有效）
        'expire'        =>  0,
        // 缓存前缀
        'prefix'        =>  '',
    ],

    // 添加更多的缓存类型设置
];
